========================= Csv Command =============================

================ How to Use CSV Command IN Pandas ===================

 Firts we upload the data to Notebook

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('pokemon.csv')
data

        Pokemon     Type
0     Bulbasaur    Grass
1       Ivysaur    Grass
2      Venusaur    Grass
3    Charmander     Fire
4    Charmeleon     Fire
..          ...      ...
716     Yveltal     Dark
717     Zygarde   Dragon
718     Diancie     Rock
719       Hoopa  Psychic
720   Volcanion     Fire

[721 rows x 2 columns]


#

================= How to Convert the data in Series===================

In [3]:
# to Convert the data to Series using the squeeze command
data=pd.read_csv('pokemon.csv',squeeze=True,usecols=['Pokemon'])
data

C:\Users\user\AppData\Local\Temp\ipykernel_9016\31923327.py:2: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  data=pd.read_csv('pokemon.csv',squeeze=True,usecols=['Pokemon'])

0       Bulbasaur
1         Ivysaur
2        Venusaur
3      Charmander
4      Charmeleon
          ...
716       Yveltal
717       Zygarde
718       Diancie
719         Hoopa
720     Volcanion
Name: Pokemon, Length: 721, dtype: object

In [4]:
data = pd.read_csv('google_stock_price.csv',usecols=['Stock Price'],squeeze=True)
data

C:\Users\user\AppData\Local\Temp\ipykernel_9016\496781302.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  data = pd.read_csv('google_stock_price.csv',usecols=['Stock Price'],squeeze=True)

0        50.12
1        54.10
2        54.65
3        52.38
4        52.95
         ...
3007    772.88
3008    771.07
3009    773.18
3010    771.61
3011    782.22
Name: Stock Price, Length: 3012, dtype: float64

In [5]:
print('sum=',data.sum())
print('Avg=',data.mean())
print('Product=',data.product())
print('Max_Value=',data.max())
print('Min_Value=',data.min())

sum= 1006942.0
Avg= 334.3100929614874
Product= inf
Max_Value= 782.22
Min_Value= 49.95

In [6]:
data=pd.read_csv('google_stock_price.csv')
data

      Stock Price
0           50.12
1           54.10
2           54.65
3           52.38
4           52.95
...           ...
3007       772.88
3008       771.07
3009       773.18
3010       771.61
3011       782.22

[3012 rows x 1 columns]

In [7]:
data.describe()

       Stock Price
count  3012.000000
mean    334.310093
std     173.187205
min      49.950000
25%     218.045000
50%     283.315000
75%     443.000000
max     782.220000

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3012 entries, 0 to 3011
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Stock Price  3012 non-null   float64
dtypes: float64(1)
memory usage: 23.7 KB

In [9]:
data.shape

(3012, 1)

In [10]:
data.size

3012

In [11]:
data=pd.read_csv('pokemon.csv')
data

        Pokemon     Type
0     Bulbasaur    Grass
1       Ivysaur    Grass
2      Venusaur    Grass
3    Charmander     Fire
4    Charmeleon     Fire
..          ...      ...
716     Yveltal     Dark
717     Zygarde   Dragon
718     Diancie     Rock
719       Hoopa  Psychic
720   Volcanion     Fire

[721 rows x 2 columns]

In [13]:
data.head(10)         #-----> Put the value of value of head in brakects to find see the top value of data

      Pokemon   Type
0   Bulbasaur  Grass
1     Ivysaur  Grass
2    Venusaur  Grass
3  Charmander   Fire
4  Charmeleon   Fire
5   Charizard   Fire
6    Squirtle  Water
7   Wartortle  Water
8   Blastoise  Water
9    Caterpie    Bug

In [15]:
data.tail()# see the buttom value of data is due to cammand tail

       Pokemon     Type
716    Yveltal     Dark
717    Zygarde   Dragon
718    Diancie     Rock
719      Hoopa  Psychic
720  Volcanion     Fire


#

#========================= Sorting the data in Pandas===============================

#===============================Sort_values()======================================

In [19]:
data=pd.read_csv('pokemon.csv',squeeze=True,usecols=['Pokemon'])
data.sort_values()

C:\Users\user\AppData\Local\Temp\ipykernel_9016\3871248454.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  data=pd.read_csv('pokemon.csv',squeeze=True,usecols=['Pokemon'])

459    Abomasnow
62          Abra
358        Absol
616     Accelgor
680    Aegislash
         ...
570      Zoroark
569        Zorua
40         Zubat
633     Zweilous
717      Zygarde
Name: Pokemon, Length: 721, dtype: object

In [21]:
data.sort_values(ascending=True)
data.sort_values(ascending=False)

717      Zygarde
633     Zweilous
40         Zubat
569        Zorua
570      Zoroark
         ...
680    Aegislash
616     Accelgor
358        Absol
62          Abra
459    Abomasnow
Name: Pokemon, Length: 721, dtype: object

In [25]:
stock=pd.read_csv('google_stock_price.csv',squeeze=True,usecols=['Stock Price'])
stock

C:\Users\user\AppData\Local\Temp\ipykernel_9016\446348386.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  stock=pd.read_csv('google_stock_price.csv',squeeze=True,usecols=['Stock Price'])

0        50.12
1        54.10
2        54.65
3        52.38
4        52.95
         ...
3007    772.88
3008    771.07
3009    773.18
3010    771.61
3011    782.22
Name: Stock Price, Length: 3012, dtype: float64

In [29]:
stock.sort_values()
stock.sort_values(ascending=True)
stock.sort_values(ascending=False)

3011    782.22
2859    776.60
3009    773.18
3007    772.88
3010    771.61
         ...
12       50.74
10       50.70
0        50.12
9        50.07
11       49.95
Name: Stock Price, Length: 3012, dtype: float64

In [32]:
stock.sort_values(ascending=True,inplace=False)
stock.sort_values(ascending=True,inplace=True)
stock

11       49.95
9        50.07
0        50.12
10       50.70
12       50.74
         ...
3010    771.61
3007    772.88
3009    773.18
2859    776.60
3011    782.22
Name: Stock Price, Length: 3012, dtype: float64

#

#==============================Sort_index command===============================

In [34]:
data.sort_index()

0       Bulbasaur
1         Ivysaur
2        Venusaur
3      Charmander
4      Charmeleon
          ...
716       Yveltal
717       Zygarde
718       Diancie
719         Hoopa
720     Volcanion
Name: Pokemon, Length: 721, dtype: object

In [37]:
data.sort_index(ascending=True)
data.sort_index(ascending=False)
data.sort_index(ascending=True,inplace=True)
data

0       Bulbasaur
1         Ivysaur
2        Venusaur
3      Charmander
4      Charmeleon
          ...
716       Yveltal
717       Zygarde
718       Diancie
719         Hoopa
720     Volcanion
Name: Pokemon, Length: 721, dtype: object